{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "border_mode": "same", "activity_regularizer": null, "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "tf", "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 8000, "input_dtype": "float32", "b_learning_rate_multiplier": null, "batch_input_shape": [null, 1, 10, 2], "W_regularizer": null, "activation": "linear", "nb_row": 10}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dropout", "config": {"p": 0.0, "trainable": true, "name": "dropout_8"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_6", "border_mode": "same", "activation": "relu", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "tf", "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 2000, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activity_regularizer": null, "nb_row": 1}}, {"class_name": "Dropout", "config": {"p": 0.0, "trainable": true, "name": "dropout_9"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_7", "border_mode": "same", "activation": "relu", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "tf", "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 2000, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activity_regularizer": null, "nb_row": 1}}, {"class_name": "Dropout", "config": {"p": 0.0, "trainable": true, "name": "dropout_10"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_8", "border_mode": "same", "activation": "relu", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "tf", "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 2000, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activity_regularizer": null, "nb_row": 1}}, {"class_name": "Dropout", "config": {"p": 0.0, "trainable": true, "name": "dropout_11"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_5", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 20000, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 2000}}, {"class_name": "Dropout", "config": {"p": 0.0, "trainable": true, "name": "dropout_12"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_6", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 2000, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 2000}}, {"class_name": "Dropout", "config": {"p": 0.0, "trainable": true, "name": "dropout_13"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_7", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 2000, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 2000}}, {"class_name": "Dropout", "config": {"p": 0.0, "trainable": true, "name": "dropout_14"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_8", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 2000, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_4"}}]}