{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_21", "output_dim": 1000, "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dtype": "float32", "input_dim": 20, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "batch_input_shape": [null, 20]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_21"}}, {"class_name": "Dropout", "config": {"p": 0.0, "trainable": true, "name": "dropout_21"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_22", "output_dim": 1000, "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dtype": "float32", "input_dim": 1000, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "batch_input_shape": [null, 20]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_22"}}, {"class_name": "Dropout", "config": {"p": 0.0, "trainable": true, "name": "dropout_22"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_23", "output_dim": 1000, "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dtype": "float32", "input_dim": 1000, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "batch_input_shape": [null, 20]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_23"}}, {"class_name": "Dropout", "config": {"p": 0.0, "trainable": true, "name": "dropout_23"}}, {"class_name": "Dropout", "config": {"p": 0.0, "trainable": true, "name": "dropout_24"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_24", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1000, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_24"}}]}